AWS_RedisCluster/6_redis/2Stress_vm2.txt
====== PING_INLINE ======
  100000 requests completed in 7.08 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
5.35% <= 2 milliseconds
34.93% <= 3 milliseconds
70.41% <= 4 milliseconds
93.18% <= 5 milliseconds
98.44% <= 6 milliseconds
99.42% <= 7 milliseconds
99.78% <= 8 milliseconds
99.88% <= 9 milliseconds
99.94% <= 10 milliseconds
99.95% <= 12 milliseconds
99.95% <= 13 milliseconds
99.97% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 203 milliseconds
14132.28 requests per second

====== PING_BULK ======
  100000 requests completed in 7.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
2.96% <= 2 milliseconds
24.26% <= 3 milliseconds
62.94% <= 4 milliseconds
90.31% <= 5 milliseconds
98.19% <= 6 milliseconds
99.66% <= 7 milliseconds
99.79% <= 8 milliseconds
99.84% <= 9 milliseconds
99.88% <= 10 milliseconds
99.89% <= 11 milliseconds
99.90% <= 14 milliseconds
99.91% <= 15 milliseconds
99.94% <= 16 milliseconds
99.97% <= 17 milliseconds
99.99% <= 18 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
100.00% <= 207 milliseconds
100.00% <= 208 milliseconds
100.00% <= 208 milliseconds
13253.81 requests per second

====== SET ======
  100000 requests completed in 6.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
10.92% <= 2 milliseconds
44.05% <= 3 milliseconds
73.01% <= 4 milliseconds
91.00% <= 5 milliseconds
97.88% <= 6 milliseconds
99.57% <= 7 milliseconds
99.76% <= 8 milliseconds
99.80% <= 9 milliseconds
99.85% <= 10 milliseconds
99.89% <= 11 milliseconds
99.93% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
14799.47 requests per second

====== GET ======
  100000 requests completed in 7.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
2.32% <= 2 milliseconds
21.26% <= 3 milliseconds
58.94% <= 4 milliseconds
86.96% <= 5 milliseconds
97.24% <= 6 milliseconds
99.47% <= 7 milliseconds
99.87% <= 8 milliseconds
99.92% <= 9 milliseconds
99.95% <= 11 milliseconds
99.95% <= 13 milliseconds
99.97% <= 14 milliseconds
99.99% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
12828.74 requests per second

====== INCR ======
  100000 requests completed in 6.36 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
10.30% <= 2 milliseconds
50.50% <= 3 milliseconds
81.23% <= 4 milliseconds
95.27% <= 5 milliseconds
99.25% <= 6 milliseconds
99.75% <= 7 milliseconds
99.83% <= 8 milliseconds
99.88% <= 9 milliseconds
99.95% <= 10 milliseconds
100.00% <= 10 milliseconds
15715.86 requests per second

====== LPUSH ======
  100000 requests completed in 5.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
17.44% <= 2 milliseconds
68.10% <= 3 milliseconds
90.78% <= 4 milliseconds
97.40% <= 5 milliseconds
99.27% <= 6 milliseconds
99.74% <= 7 milliseconds
99.87% <= 8 milliseconds
99.92% <= 9 milliseconds
99.92% <= 10 milliseconds
99.93% <= 11 milliseconds
99.94% <= 12 milliseconds
99.95% <= 13 milliseconds
100.00% <= 15 milliseconds
100.00% <= 202 milliseconds
100.00% <= 204 milliseconds
100.00% <= 207 milliseconds
17739.93 requests per second

====== RPUSH ======
  100000 requests completed in 5.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
19.18% <= 2 milliseconds
73.11% <= 3 milliseconds
94.64% <= 4 milliseconds
98.57% <= 5 milliseconds
99.57% <= 6 milliseconds
99.90% <= 7 milliseconds
99.97% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 204 milliseconds
100.00% <= 204 milliseconds
18573.55 requests per second

====== LPOP ======
  100000 requests completed in 6.53 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
9.77% <= 2 milliseconds
46.13% <= 3 milliseconds
79.01% <= 4 milliseconds
94.65% <= 5 milliseconds
99.00% <= 6 milliseconds
99.78% <= 7 milliseconds
99.90% <= 8 milliseconds
99.96% <= 9 milliseconds
99.97% <= 10 milliseconds
99.98% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 205 milliseconds
15323.32 requests per second

====== RPOP ======
  100000 requests completed in 5.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
22.51% <= 2 milliseconds
82.41% <= 3 milliseconds
98.61% <= 4 milliseconds
99.79% <= 5 milliseconds
99.94% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 202 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
19924.29 requests per second

====== SADD ======
  100000 requests completed in 5.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
20.07% <= 2 milliseconds
79.05% <= 3 milliseconds
97.76% <= 4 milliseconds
99.31% <= 5 milliseconds
99.54% <= 6 milliseconds
99.74% <= 7 milliseconds
99.77% <= 8 milliseconds
99.82% <= 9 milliseconds
99.86% <= 10 milliseconds
99.89% <= 11 milliseconds
99.92% <= 12 milliseconds
99.96% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 203 milliseconds
100.00% <= 205 milliseconds
19219.68 requests per second

====== HSET ======
  100000 requests completed in 5.57 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
15.91% <= 2 milliseconds
69.90% <= 3 milliseconds
94.50% <= 4 milliseconds
98.55% <= 5 milliseconds
99.32% <= 6 milliseconds
99.57% <= 7 milliseconds
99.79% <= 8 milliseconds
99.85% <= 9 milliseconds
99.88% <= 10 milliseconds
99.92% <= 11 milliseconds
99.94% <= 12 milliseconds
99.97% <= 13 milliseconds
100.00% <= 13 milliseconds
17953.32 requests per second

====== SPOP ======
  100000 requests completed in 5.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
17.05% <= 2 milliseconds
65.92% <= 3 milliseconds
88.30% <= 4 milliseconds
95.90% <= 5 milliseconds
98.90% <= 6 milliseconds
99.59% <= 7 milliseconds
99.71% <= 8 milliseconds
99.78% <= 9 milliseconds
99.83% <= 10 milliseconds
99.88% <= 11 milliseconds
99.93% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 202 milliseconds
17301.04 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 7.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
8.89% <= 2 milliseconds
34.26% <= 3 milliseconds
64.33% <= 4 milliseconds
85.62% <= 5 milliseconds
96.04% <= 6 milliseconds
99.09% <= 7 milliseconds
99.65% <= 8 milliseconds
99.82% <= 9 milliseconds
99.93% <= 10 milliseconds
99.96% <= 11 milliseconds
99.98% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 204 milliseconds
100.00% <= 210 milliseconds
13618.41 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 7.48 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
7.23% <= 2 milliseconds
32.72% <= 3 milliseconds
64.86% <= 4 milliseconds
87.30% <= 5 milliseconds
96.00% <= 6 milliseconds
98.49% <= 7 milliseconds
99.10% <= 8 milliseconds
99.29% <= 9 milliseconds
99.42% <= 10 milliseconds
99.53% <= 11 milliseconds
99.57% <= 12 milliseconds
99.61% <= 13 milliseconds
99.68% <= 14 milliseconds
99.74% <= 15 milliseconds
99.77% <= 16 milliseconds
99.82% <= 17 milliseconds
99.83% <= 18 milliseconds
99.84% <= 19 milliseconds
99.85% <= 20 milliseconds
99.88% <= 21 milliseconds
99.90% <= 24 milliseconds
99.90% <= 27 milliseconds
99.92% <= 28 milliseconds
99.95% <= 36 milliseconds
99.96% <= 38 milliseconds
100.00% <= 205 milliseconds
100.00% <= 209 milliseconds
100.00% <= 211 milliseconds
13361.84 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 7.42 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
4.40% <= 2 milliseconds
28.11% <= 3 milliseconds
64.03% <= 4 milliseconds
89.73% <= 5 milliseconds
97.68% <= 6 milliseconds
99.42% <= 7 milliseconds
99.78% <= 8 milliseconds
99.89% <= 9 milliseconds
99.96% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 204 milliseconds
13484.36 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.57 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
5.71% <= 2 milliseconds
26.73% <= 3 milliseconds
60.87% <= 4 milliseconds
86.49% <= 5 milliseconds
96.67% <= 6 milliseconds
99.25% <= 7 milliseconds
99.65% <= 8 milliseconds
99.78% <= 9 milliseconds
99.84% <= 10 milliseconds
99.89% <= 11 milliseconds
99.90% <= 12 milliseconds
99.90% <= 16 milliseconds
99.90% <= 17 milliseconds
99.95% <= 19 milliseconds
99.98% <= 24 milliseconds
100.00% <= 25 milliseconds
100.00% <= 25 milliseconds
13215.28 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
11.11% <= 2 milliseconds
43.89% <= 3 milliseconds
73.16% <= 4 milliseconds
91.14% <= 5 milliseconds
98.15% <= 6 milliseconds
99.58% <= 7 milliseconds
99.78% <= 8 milliseconds
99.84% <= 9 milliseconds
99.90% <= 10 milliseconds
99.90% <= 17 milliseconds
99.90% <= 18 milliseconds
99.91% <= 19 milliseconds
99.93% <= 20 milliseconds
99.94% <= 21 milliseconds
99.95% <= 23 milliseconds
99.95% <= 24 milliseconds
100.00% <= 25 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
14784.15 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 5.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
22.13% <= 2 milliseconds
81.55% <= 3 milliseconds
98.16% <= 4 milliseconds
99.75% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 203 milliseconds
100.00% <= 203 milliseconds
19762.85 requests per second